# OrdinateDimensionSetting Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OrdinateDimensionSetting Constructor
OrdinateDimensionSetting Class See Also
---
Constructs a new OrdinateDimensionSetting object with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public OrdinateDimensionSetting()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
OrdinateDimensionSetting()
```

# See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace